-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: database
-- Час створення: Квт 20 2024 р., 08:23
-- Версія сервера: 8.3.0
-- Версія PHP: 8.2.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+03:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `zlagoda`
--

-- --------------------------------------------------------

--
-- Структура таблиці `Product`
--

CREATE TABLE `Product` (
  `id_product` int NOT NULL,
  `category_number` int NOT NULL,
  `product_name` varchar(50) NOT NULL,
  `producer` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `characteristics` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп даних таблиці `Product`
--

INSERT INTO `Product` (`id_product`, `category_number`, `product_name`, `producer`, `characteristics`) VALUES
(1, 7, 'Печиво Oreo', 'Mondelez International', 'Шоколадне печиво з молочною начинкою'),
(6, 6, 'Сік Садочок виноград-яблуко 1л', 'Sandora', 'Виноградно-яблучний сік, 1л'),
(23, 1, 'Сирок глазурований', 'Чудо', 'Сирок глазурований з карамельною начинкою, 100г'),
(24, 6, 'Сік Садочок апельсин 1л', 'Sandora', 'Апельсиновий сік, 1л'),
(25, 7, 'Lion', 'Nestle', 'шоколадний батончик з карамеллю'),
(36, 1, 'Молоко', 'Яготинське', '1л пастеризованого молока, 2% жирності'),
(37, 1, 'Кефір', 'Слов\'яночка', 'Кефір 5% жирності'),
(38, 7, 'Barni шоколадний', 'Nestle', 'Бісквітний батончик з шоколадною начинкою'),
(52, 1, 'Молоко', 'Слов&#39;яночка', '1л пастеризованого молока, 1.5% жирності'),
(53, 6, 'Fanta 0.5л', 'Sandora', 'Газований напій зі смаком апельсину, 0.5л'),
(54, 6, 'Fanta 1л', 'Sandora', 'Газований напій зі смаком апельсину, 1л'),
(55, 6, 'Моршинська сильногазована 1,5л', 'Моршинська', 'Вода сильногазована з Моршинських джерел 1,5л'),
(56, 6, 'Моршинська негазована 1,5л', 'Моршинська', 'Вода негазована з Моршинських джерел 1,5л'),
(57, 7, 'Печиво Марія', 'Yarich', 'Затяжне печиво округлої форми в упаковці 155г'),
(58, 7, 'Шоколад Lacmi', 'Roshen', ' Плитка шоколаду з начинкою 90г'),
(59, 7, 'Шоколад Milka', 'Milka', 'Плитка молочного шоколаду 90г'),
(60, 2, 'Булка з сиром', 'Zlagoda', 'Булка з сиром добре пропечена'),
(61, 2, 'Батон', 'КиївХліб', 'Батон пшеничний з борошна вищого ґатунку'),
(62, 2, 'Рулет з маком', 'Zlagoda', 'Рулет з солодким маком власної випічки'),
(63, 2, 'Хліб \"Бородинський\"', 'КиївХліб', 'Хліб чорний \"Бородинський\" з тміном'),
(65, 2, 'Булочки \"Малятко\"', 'КиївХліб', 'Маленька здобна булочка'),
(66, 12, 'Пюре яблучне дитяче', 'Gerber', 'Пюре яблучне для дітей, поживне, без хімікатів'),
(67, 12, 'Пюре Nan', 'Nestle', 'Пюре дитяче з мікроелементами для хорошого травлення'),
(68, 12, 'Суміш молочна суха Nutrilon', 'Nutricia', 'Суміш молочна суха для харчування дітей 12-24 місяців'),
(69, 9, 'Гречка', 'Розумний вибір', 'Крупа гречана ядриця 1кг'),
(70, 9, 'Булгур', 'Pere', 'Крупа булгур 1кг'),
(71, 9, 'Рис', 'Trapeza', 'Рис камоліно 1кг'),
(72, 9, 'Кускус', 'Pere', 'Крупа кускус 1кг'),
(73, 9, 'Вівсянка', 'Bruggen', 'Крупа вівсянка цільнозернова 500г'),
(74, 9, 'Перловка', 'Сквирянка', 'Крупа ячмінна перлова 800г'),
(75, 1, 'Сир домашній', 'President', 'Сир домашній кисломолочний 5% жирності 500г'),
(76, 5, 'Філе куряче', 'Наша Ряба', 'Філе куряче охолоджене 1кг'),
(77, 5, 'Стейк ягняти', 'М&#39;ясторія', 'Стейк ягняти соковитий 1кг'),
(78, 5, 'Ковбаса Лікарська', 'Ятрань', 'Ковбаса Лікарська першого сорту 1кг'),
(79, 5, 'Ковбаса Баварська', 'Ятрань', 'Ковбаса Баварська вищого сорту 1кг'),
(80, 5, 'Кабаноси', 'Дмитрук', 'Ковбаски копчені 650г'),
(81, 3, 'Огірок', 'Zlagoda', 'Огірок короткоплідний'),
(82, 3, 'Помідор', 'Zlagoda', 'Помідор рожевий'),
(83, 3, 'Капуста пекінська', 'Zlagoda', 'Капуста пекінська вищий ґатунок'),
(84, 3, 'Морква', 'Zlagoda', 'Морква немита перший сорт'),
(85, 3, 'Буряк', 'Zlagoda', 'Буряк червоний'),
(86, 3, 'Капуста брокколі', 'Zlagoda', 'Капуста брокколі морожена 750г'),
(87, 3, 'Кабачок', 'Zlagoda', 'Кабачок'),
(88, 3, 'Картопля', 'Zlagoda', 'Картопля коломбо вищого сорту фасована 5кг'),
(89, 4, 'Яблуко', 'Zlagoda', 'Яблуко чемпіон 2кг'),
(90, 4, 'Авокадо', 'Еквадор', 'Авокадо екзотичне 1шт'),
(91, 4, 'Банан', 'Еквадор', 'Банан свіжий'),
(92, 4, 'Апельсин', 'Греція', 'Апельсин Вашингтон'),
(93, 4, 'Лохина', 'Zlagoda', 'Ягода лохина судок 300г'),
(94, 8, 'Хек', 'Flagman', 'Хек атлантичний морожений 800г'),
(95, 8, 'Ікра мойви', 'Водний світ', 'Ікра мойви з копченим лососем 200г'),
(96, 8, 'Сьогма', 'Flagman', 'Сьогма охолоджена'),
(97, 8, 'Оселедець', 'Flagman', 'Оселедець матіас'),
(98, 11, 'Чипси', 'Люкс', 'Чипси 133г зі смаком сиру/бекону/паприки'),
(99, 11, 'Арахіс смажений', 'BigBob', 'Арахіс смажений 80г зі смаком сиру/телятини з аджикою'),
(100, 11, 'Сухарики', 'Flint', 'Сухарики житні 110г зі смаком запеченої рульки'),
(101, 11, 'Кукурудзяні палички', 'МакДак', 'Кукурудзяні палички молочні 200г'),
(102, 10, 'Перець чорний', 'Приправка', 'Перець чорний мелений 50г'),
(103, 10, 'Соус сацебелі', 'Руна', 'Соус сацебелі в банці 400г'),
(104, 10, 'Куркума', 'Приправка', 'Куркума 60г');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `Product`
--
ALTER TABLE `Product`
  ADD PRIMARY KEY (`id_product`),
  ADD KEY `category_number` (`category_number`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `Product`
--
ALTER TABLE `Product`
  MODIFY `id_product` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=105;

--
-- Обмеження зовнішнього ключа збережених таблиць
--

--
-- Обмеження зовнішнього ключа таблиці `Product`
--
ALTER TABLE `Product`
  ADD CONSTRAINT `category_number` FOREIGN KEY (`category_number`) REFERENCES `Category` (`category_number`) ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
